import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:get/get.dart';
import 'package:get/get_core/src/get_main.dart';
import 'package:hexcolor/hexcolor.dart';

import '../routes/routes_name.dart';

class NamajSikkah extends StatefulWidget {
  const NamajSikkah({super.key});

  @override
  State<NamajSikkah> createState() => _NamajSikkahState();
}

class _NamajSikkahState extends State<NamajSikkah> {
  var namajSikkhaData = [
    {
      "name": "নামাজের নিয়ম",
      "arobic": "নামাজ বা নামায মূলত একটি ফার্সি শব্দ। \nএটি আরবি শব্দ সালাত বা সালাহ থেকে এসেছে।\n\n"
          " আরবি- ٱلصَّلَوَا আস-সালাওয়াত এর অর্থ হলো- দোয়া, প্রার্থনা, প্রশংসা বা আশীর্বাদ।\n\n"
          "নামাজ বা সালাত হলো আমাদের ইসলাম ধর্মের প্রধান উপাসনাকর্ম। নামাজ ইসলাম ধর্মের পাঁচটি স্তম্ভের একটি।\nঈমান বা বিশ্বাসের পর নামাজই ইসলামের সবচেয়ে গুরুত্বপূর্ণ স্তম্ভ।\n"
          "প্রতিদিন ৫ ওয়াক্ত নামাজ আদায় করা প্রত্যেক মুসলমানের জন্যই ফরজ। নামাজের সঠিক নিয়ম জানা তাই আমাদের জন্য খুবই গুরুত্বপূর্ণ।\n\nফরজ (আরবিতে: فَرْضُ) সাধারণত দুই প্রকার। \nদুই প্রকার ফরজের মধ্যে নামাজ ফরজে আইনের অন্তর্ভুক্ত।",
      "bangla": "নামাজের সংক্ষিপ্ত নিয়মাবলী"
          "\n\nআমাদের ভারতীয় উপমহাদেশের অধিকাংশ মুসলিমই হানাফি মাজহাবের অনুসারী। \nতাই হানাফি মাজহাব অনুসারেই নিচে নামাজ পড়ার সংক্ষিপ্ত নিয়ম উল্লেখ করা হলো। এখানে উল্লেখ্য, চার ইমামের যে কারো তরিকা গ্রহণ করলেও সমস্যা নেই।\n\n"
          "নামাজের নিয়ত করে উভয় হাত কান পর্যন্ত উঠাতে হবে। \nএরপরে তাকবিরে তাহরিমা পড়ার পর বাম হাতের ওপর ডান হাত রেখে নাভির নিচে হাত বাঁধতে হবে।\n\nএরপর অনুচ্চৈঃস্বরে পড়তে হবে –\n\n"
          "সুবহানাকাল্লাহুম্মা ওয়াবি হামদিকা ওয়া তাবারা কাসমুকা ওয়া তাআলা জাদ্দুকা ওয়া লা ইলাহা গাইরুকা।\n\n"
          "অর্থ :\n\nহে আল্লাহ! আমরা তোমারই পবিত্রতা ও প্রশংসা বর্ণনা করছি, তোমার নামই বরকতপূর্ণ এবং তোমার গৌরবই সর্বোচ্চ, \nতুমি ছাড়া অন্য কোনো উপাস্য নেই। (নাসায়ি, হাদিস নং : ৮৮৯)\n\n"
          "এরপর অনুচ্চৈঃস্বরে\n\nআউজু বিল্লাহি মিনাশ শায়তানির রাজিম, বিসমিল্লাহির রাহমানির রাহিম পড়ুন। (তাহাবি : ১/৩৪৭)\n\n"
          "এবার সূরা ফাতিহা পড়তে হবে। নিচে সূরা ফাতিহা উচ্চারণ ও অর্থ সহকারে দেওয়া হলো –\n\n"
          "সূরা ফাতিহা বাংলা অর্থসহ ও উচ্চারণ",
      "anubat": "সূরা আল ফাতিহা"
          "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ"
          "ٱلْحَمْدُ لِلَّٰهِ رَبِّ ٱلْعَالَمِينَ"
          "ٱلرَّحْمَٰنِ ٱلرَّحِيمِ"
          "مَالِكِ يَوْمِ ٱلدِّينِ"
          "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ"
          "ٱهْدِنَا ٱلصِّرَاطَ ٱلْمُسْتَقِيمَ"
          "صِرَاطَ ٱلَّذِينَ أَنْعَمْتَ عَلَيْهِمْ"
          "غَيۡرِ ٱلْمَغْضُوبِ عَلَيۡهِمۡ وَلَا اَ۬لضَّآلِّينَ ص۝"

          ///==============
          "সূরা ফাতিহার উচ্চারণ"
          " বিসমিল্লাহির রাহমানির রাহিম\n"
          " আলহামদুলিল্লা-হি রাব্বিল আ-লামীন\n"
          " আর রাহমা-নির রাহীম\n"
          " মা-লিকি ইয়াওমিদ্দীন\n"
          "ইয়্যা-কা না বুদু ওয়া ইয়্যা-কানাছতা ঈন\n"
          "ইহদিনাসসিরা-তাল মুছতাকীম\n"
          "সিরা-তাল্লাযীনা আন আম তা আলাইহিম\n"
          "গাইরিল মাগদূ বি আলাইহীম ওয়ালাদ্দাল্লীন।"

          //===========================
          "সূরা ফাতিহা বাংলা অর্থ"
          "পরম করুণাময় অতি দয়ালু আল্লাহর নামে\n"
          "সমস্ত প্রশংসা জগতসমূহের প্রতিপালক আল্লাহর জন্যে\n"
          " অনন্ত দয়াময়, অতীব দয়ালু\n"
          " প্রতিফল দিবসের মালিক\n"
          " আমরা শুধু আপনারই দাসত্ব করি এবং শুধু আপনারই নিকট সাহায্য কামনা করি\n"
          " আমাদের সরল পথনির্দেশ দান করুন\n"
          " তাদের পথে, যাদের আপনি অনুগ্রহ করেছেন\n"
          "এবং তাদের পথে নয় যারা আপনার ক্রোধের শিকার ও পথভ্রষ্ট।\n\n"
          " শেষ হলে আমিন বলতে হবে।\nহানাফি মাজহাব মতে, আমিন আস্তে পড়া উত্তম। তবে জোরে আমিন বলার ব্যাপারেও ইমামদের মতামত পাওয়া যায়।\n"
          "  সূরা ফাতিহা পড়া শেষ হলে একটি সূরা অথবা তিনটি ছোট আয়াত,\nযা কমপক্ষে লম্বা একটি আয়াতের সমতুল্য হয়, তাই পড়তে হবে। (আবু দাউদ, হাদিস নং : ৬৯৫)\n\n"
          "  ইমামরা বলেন,\nএই পরিমাণ তিলাওয়াত সালাত বা নামাজ শুদ্ধ হওয়ার জন্য আবশ্যক। তবে নামাজে কোরআন তিলাওয়াতের সুন্নত পরিমাণের বিষয়ের বিবরণ ফিকহের কিতাবে উল্লেখ করা আছে।\n\n"
          "  অতঃপর আল্লাহু আকবার বলে রুকুতে যেতে হবে। রুকুতে মাথা নিতম্বের বরাবর করতে হবে। (আবু দাউদ, হাদিস নং : ৭২৯)\n\n"
          "  রুকুতে আঙুলগুলো ছড়িয়ে দিয়ে হাঁটু আঁকড়ে ধরতে হবে। (মুজামে সাগির ২/৪৯৭)\n\n"
          "  রুকুতে তিনবার, পাঁচবার বা সাতবার; কমপক্ষে তিনবার \nসুবহানা রাব্বিয়াল আজিম পড়তে হবে। (তিরমিজি, হাদিস নং : ২৪২)\n\n"
          "  এবার রুকু থেকে সামিয়াল্লাহু লিমান হামিদাহ বলে মাথা উঠান।\n\nমুক্তাদি হলে অনুচ্চৈঃস্বরে শুধু রাব্বানা লাকাল হামদ বলতে হবে। \n\nএরপর তাকবির পড়ে অর্থাৎ আল্লাহু আকবার বলে সিজদায় যেতে হবে। (সহিহ বুখারি, হাদিস নং : ৭৪৭)\n\n"
          "  সিজদায় যাওয়ার সময় প্রথমে হাঁটু, তারপর হাত, তারপর উভয় হাতের মধ্যে প্রথমে নাক এবং পরে কপাল মাটিতে রাখতে হবে।\n\nনিজের পেট রান থেকে এবং বাহুকে পার্শ্বদেশ থেকে পৃথক করে রাখুন।\nহাত ও পায়ের আঙুলকে কিবলামুখী করে রাখতে হবে। (সহিহ বুখারি, হাদিস নং : ৭৮৫)\n\n"
          "  সিজদায় তিনবার, পাঁচবার বা সাতবার; \nকমপক্ষে তিনবার সুবহানা রাব্বিয়াল আলা পড়তে হবে। (তিরমিজি, হাদিস নং : ২৪২)\n\n"
          "  এরপর সিজদা থেকে উঠার সময় সর্বপ্রথম মাথা উঠিয়ে উভয় হাত রানের ওপর রেখে স্থিরতার সঙ্গে বসে পড়তে হবে।\n\nএরপর তাকবির বলে দ্বিতীয় সিজদা করতে হবে।\nদ্বিতীয় সিজদায়ও এরপর কমপক্ষে তিনবার তাসবিহ পড়তে হবে।\nবিজোড় সংখ্যায় এর বেশিও তাসবিহ পড়া যাবে। \nএরপর জমিনে হাত দ্বারা ঠেক না দিয়ে এবং না বসে সরাসরি তাকবির বলে দাঁড়িয়ে যেতে হবে।\n\nএ পর্যন্ত আমাদের প্রথম রাকাত সম্পন্ন হয়েছে।\n\n"
          "  এবার দ্বিতীয় রাকাত আরম্ভ হলো।\nএতে হাত উঠাতে হবে না, ছানাও পড়বেন না, আউজুবিল্লাহও পড়তে হবে না।\nতবে আগের মতো সূরা ফাতিহা ও এর সাথে অন্য একটি সূরা পড়ে রুকু-সিজদা করতে হবে।\n\nদ্বিতীয় সিজদা শেষ করে ডান পা খাড়া করে বাম পা জায়নামাজে বিছিয়ে দিয়ে তার ওপর বসে যেতে হবে।\n\nতখন হাত রাখতে হবে রানের ওপর এবং ডান পায়ের আঙুলগুলো থাকবে কিবলামুখী। (মুসলিম, হাদিস নং : ৯১২)\n\n"
          "অতঃপর তাশাহুদ পড়তে হবে। (সহিহ বুখারি, হাদিস নং : ৭৮৮)\n\n"

          //////////////////////////////////============================
          "  তাশাহুদ বা আত্তাহিয়াতু দোয়া"
          "  – اَلتَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَن لَّاإِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. –"

          //============================
          "  তাশাহুদ বা আত্তাহিয়াতু এর উচ্চারণ"
          "  আত্তাহিয়্যাতু লিল্লাহি ওয়াস সালাওয়াতু ওয়াত তায়্যিবাত।\nআসসালামু আলাইকা, আইয়্যু হান্নাবিয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহ।\nআস সালামু আলাইনা ওয়া আলা ইবাদিল্লাহিস সালিহিন। আশহাদু আল-লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসুলুহ।\n\n"
          "  তাশাহুদ পড়ার সময় \nআশহাদু আল-লা ইলাহা\nপড়ার সময় শাহাদাত আঙুল উঁচু করে ইশারা করতে হবে।\n\nআর ইল্লাল্লাহু বলার সময় আঙুল নামিয়ে ফেলতে হবে।\n\n"
          "  তবে তাশাহুদের বাক্য ও আঙুল দিয়ে ইশারা করার বিষয়ে অন্য নিয়মও ইমামদের বক্তব্যে দেখা যায়।\nতাই বিষয়টি নিয়ে কোনো বাড়াবাড়ি করা কাম্য নয়।\n\n"
          "  যদি নামাজ দুই রাকাতবিশিষ্ট হয়, যেমন—ফজরের নামাজ, তাহলে তাশাহুদের পর নিম্নের দরুদ শরিফ পাঠ করতে হবে (মুসলিম, হাদিস নং : ৬১৩)–"

          //==========================================
          "  তাশাহুদের পর দরুদ শরীফ"
          "  اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَّعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيْمَ وَعَلَى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ, وبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيْمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِْيدٌ مَجِيْدٌ . –"

          //===============================
          " দরুদ শরীফ এর উচ্চারণ"
          "  আল্লাহুম্মা সাল্লি আলা মুহাম্মদ, ওয়ালা আলি মুহাম্মদ, কামা সাল্লাইতা আলা ইবরাহিমা ওয়া আলা আলি ইবরাহিম, ইন্নাকা হামিদুম মাজিদ।\nআল্লাহুম্মা বারিক আলা মুহাম্মদ, ওয়ালা আলি মুহাম্মদ, কামা বারাকতা আলা ইবরাহিমা ওয়া আলা আলি ইবরাহিম, ইন্নাকা হামিদুম মাজিদ।\n\n"
          "  এরপর পবিত্র কোরআন ও হাদিসে বর্ণিত যে কোনো দোয়া পাঠ করতে হবে। (মুসান্নাফে ইবনে আবি শায়বা, ১/২৯৮)\n\n"
          "  যেমন— দোয়ায়ে মাসুরা পড়তে পারেন। (সহিহ বুখারি, হাদিস : ৭৯)"

          //============================
          " দোয়ায়ে মাসুরা বা দোয়া মাসুরা"
          "  اللّٰهُمَّ إِنِّيْ ظَلَمْتُ نَفْسِيْ ظُلْمْاً كَثِيْراً، وَلاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِيْ مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفُوْرُ الرَّحِيْمُ"

          ////============================
          "   দোয়ায়ে মাসুরা বা দোয়া মাসুরার উচ্চারণ"
          "  আল্লাহুম্মা ইন্নি জালামতু নাফসি জুলমান কাসিরাও ওলা ইয়াগফিরুজ জুনুবা ইল্লা আনতা,\nফাগফিরলি মাগফিরাতাম-মিন ইনদিকা, ওয়ার হামনি ইন্নাকা আনতাল গাফুরুর রাহিম।\n\n"
          " অথবা এই দোয়া পড়বেন—\n\n"
          "  রাব্বানা আতিনা ফিদ-দুনইয়া হাসানাহ\nওয়া ফিল আখিরাতি হাসানাহ, ওয়া কিনা আজাবান-নার।\n\n"
          "  অতঃপর\nআসসালামু আলাইকুম ওয়া রাহমাতুল্লাহ বলতে ডানে এবং বাঁয়ে মাথা ফেরাতে হবে।\nসালাম ফেরানোর সময় পাশের নামাজি ব্যক্তি এবং ফেরেশতাদের কথা স্মরণ করবেন।\n\n"
          "  যদি নামাজ তিন রাকাতবিশিষ্ট হয়, যেমন—মাগরিবের নামাজ, তখন প্রথম বৈঠকে তাশাহহুদের পর আর কিছু পড়বে না।\n\nবরং আল্লাহু আকবার বলে সোজা দাঁড়িয়ে যেতে হবে। (তিরমিজি, হাদিস : ২২৪)\n\n"
          "  তবে তৃতীয় রাকাতে শুধু সুরা ফাতিহা পড়তে হবে।\nআর নামাজ যদি চার রাকাতবিশিষ্ট হয়, যেমন—জোহর, আসর ও এশার নামাজ, তখন চতুর্থ রাকাতেও শুধু সুরা ফাতিহা পড়তে হবে।\n\nএরপর প্রথম দুই রাকাতের মতো রুকু-সিজদা করে দুই রাকাত সম্পন্ন করে শেষ বৈঠকে বসবেন।\nসেখানে উল্লিখিত পদ্ধতিতে তাশাহহুদের পর দরুদ এবং এরপর দোয়ায়ে মাসুরা পড়ে উভয় দিকে সালাম ফেরাতে হবে।\n\n"

          //=================
          "  কিভাবে ফজরের নামাজ পড়বেন"
          "  বিসমিল্লাহির রাহমানির রাহিম\n\nআসসালামুয়ালাইকুম উয়া রাহমাতুল্লাহ।\nমহান আল্লাহ রাব্বুল আলামিনের দরবারে অশেষ মেহেরবানি যিনি এই আসমান,জমিন লৌহ কলম সৃষ্টি করেছেন।\n\nআমরা একমাত্র তারই এবাদত করি। আর এই ইবাদাতের মূল হচ্ছে নামাজ।\n\nনামাজ এমন একটি ইবাদাত যার দ্বারা অতি সহজে আল্লহর নৈকট্য অর্জন করা যায়। \n\nনামাজ মানে শান্তি,নামাজ মানে বেহেস্ত। যেমনটা আমরা জানি (আসসালাতু মিফতাহুল জান্নাহ, অর্থাৎ,নামাজ বেহেস্তের চাবি) অন্যভাবে বলতে গেলে নামাজ হচ্ছে দিনের খুটি (আসসালাতু ইমাদুদ্দিন)। \n\nমহান আল্লাহ পাক রাব্বুল আলামিন নামাজকে অতিব গুরুত্ব দেওয়ার কথা বলেছেন। \n\nআর আজকে নামাজ এর স্বয়ং সম্পুর্ণ বিষয়াবলি নিয়ে আলোচনা করা হলো। \n\nনামাজ মূলত হচ্ছে ৫ ওয়াক্ত যা ফরজ এমনকি বাধ্যতামূলক। \n\nপরবর্তিতে যে গুলা প্রয়োজনীয় যেমন, জুময়ার নামাজ, জানাযার নামাজ এগুলো নিয়েও পর্যায়ক্রমে আলোচনা করা হলো।\n\n১। ফজরঃ ফজরের নামাজ হচ্ছে সকল নামাজের মূল। \nফজরের নামাজের অনেক ফজিলত রয়েছে। তার মধ্যে একটি হলো ফজরের নামাজ মানুষের চেহারার সৌন্দর্য বৃদ্ধি করে।\n\n"
          " সময়ঃ সূর্যদয়ের ২৩ মিনিট পুর্ব পর্যন্ত। \nঅর্থাৎ তাহাজ্জুতের নামাজের পর থেকে শুরু। সাধারন ভাবে রাত ১২টার পর থেকে ফজরের নামাজের সময় শুরু হয়।\n\n"
          " নিয়মঃ ফজরের নামাজ ৪ রাকাত। ২ রাকাত সুন্নত এবং ২ রাকাত ফরজ।\n\n"
          " ২ রাকাত সুন্নত নামাজ পড়ার নিয়ম হলোঃ প্রথমে অজু করে জায় নামাজে দাড়াতে হবে।\n\n"
          "  দোয়া পরতে হবে -জায়নামাজের । \n\n(ইন্নি উয়াজ্জাহতু উয়াজহিয়া লিল্লাজি ফাতারা সসামাওয়াতি উয়াল আরদ্বি হানিফা উয়ামা আনা মিনাল মুশরিকিন)।\n\n"
          " নিয়তঃ তারপর নিয়ত করতে হবে, \n\n(নাওয়াইতু আন উসাল্লিয়া লিল্লাহিতায়ালা রাকাতাই সালাতি ফাজরি সুন্নাতু রাসুলিল্লাহি তায়ালা মুতাওয়াজ্জিহান ইলা জিহাতিল ক্বাবাতিশ শারিফাতি আল্লাহু আকবার) বলে রাকাত বাধতে হবে।\n\nদুই হাত কাধ বরাবর নিয়ে যাতে হাতের তালু দুইটি কাবার দিকে থাকে তারপর হাত নামিয়ে নাভির নিচে অথবা নাভির উপরে বাধতে হবে।\n\n"
          " অতঃপর পড়তে হবে (সুবহানাকা আল্লাহুম্মা বিহামদিকা উতাওয়া রাকাসমুকা উয়াতায়ালা জাদ্দুকা উয়ালা ইলাহা গাইরুক)। \n\nতারপর সুরা ফাতিহা পড়তে হবে (আলহামদু লিল্লাহি রাব্বিল আলামিন, আররাহমানির রাহিম,মা-লিকিয়াউ মিদ্দিন, ইয়া কানা বুদু উয়া ইয়া কানাসতায়িন,\n\nইহদিনাসসিরাতাল মুস্তাকিম, সিইরা ত্বাল্লাজিনা আন আম তায়ালাইহিম, ঘাইরিল মাগদু বিয়ালাইহিম, উয়ালাদ্দুয়াল্লিন, আমিন) \n\nএর পর যে কোন একটি সূরা পড়তে হবে \n\n"
          " তারপর আল্লাহু আকবার বলে রুকুতে যেতে হবে।\nরুকুতে গিয়ে পড়তে হবে { সুবহানা রাব্বিয়াল আযিম (৩ বার উত্তম, এর থেকে বেশি পড়লে ভাল)} সামিয়াল্লাহুলিমান হামিদা বলে রুকু থেকে উঠতে হবে।\n\nসোজা হয়ে দাড়াতে হবে। তারপর আবার আল্লহু আকবার বলে সিজদায় যেতে হবে। (সিজদার নিয়ম হচ্ছে প্রথমে পায়ের পাতা থেকে কোমর পর্যন্ত সোজা রেখে দেহটাকে নিচের দিকে ঝুকিয়ে পরবর্তিতে হাটু ঝুকিয়ে প্রথমে নাক পরে কপাল মাঠিতে লাগানো)\n\n"
          "  সিজদায় গিয়ে পড়তে হবে (সুবহানা রাব্বিয়াল আলা,  ঠিক আগের মতো, ৩ বার উত্তম, বেশি পড়লে ভালো)। \n\nআল্লাহু আকবার বলে সিজদাহ থেকে বসা, সিজদা দুটি দিতে হয়। সেজন্য আল্লাহু আকবার বলে সিজদাহ থেকে বসা অবস্তায় তারপর আবার সিজদায় যেতে হবে।\n\nএবং ২য় সেজদায় আগের মতোই হবে (সুবহানা রাব্বিয়াল আলা,  ঠিক আগের মতো, ৩ বার উত্তম, বেশি পড়লে ভালো) বলতে হবে। তবে এখানে উল্লেখ দুই সেজদার মাঝে এই দোয়াটি পড়তে হবে।\n\nদোয়াটি পড়তে এই লিংকে ক্লিক করুন। তারপর আল্লাহু আকবার বলে দাড়িয়ে যেতে হবে।\n\n"

          //==========================
          "  শেষ রাকাতের নিয়ম"
          "আবার ঠিক আগের মতোই সূরা ফাতিহা এবং তার সাথে মিলিয়ে যে কোন একটি সুরা পড়তে হবে।\n\nতার পর রুকুতে যেতে হবে রুকু গিয়ে (সুবহানা রাব্বিয়াল আযিম) (৩ বার উত্তম, এর থেকে বেশি পড়লে ভাল)}\n\nতারপর সামিয়াল্লাহুলিমান হামিদা বলে দাড়াতে হবে। \nআল্লাহু আকবার বলে সিজদায় যেতে হবে। সিজদায় গিয়ে ঠিক আগের মতোই (সুবহানা রাব্বিয়াল আলা) তারপর আল্লাহু আকবার বলে প্রথম বার বসতে হবে। \nতার পর দ্বিতীয় বার সেজদায় সেতে হবে (প্রথম রাকাতের মতোই) ।\n\n"
          "এখন দ্বিতীয় বারে দ্বিতীয় রাকাতে বসে পড়তে হবে।\nঅর্থাৎ ২য় রাকাতের সেজদা উঠে থেকে বসতে হবে। \n\nতারপর বসেই পড়তে হবে (আত্তাহিয়াতু লিল্লাহি উয়াসসালাউয়াতু উয়াত্তাইয়িবাতি আসসালামু আলাইকা আইয়ু হান্নাবিয়ু উউয়া রাহমাতুল্লাহি উয়া বারাকাতুহু আসসালামু আলাইনা আলা ইবাদিল্লাহিস সুয়ালিহিন, আসহাদু আল্লাহ ইলাহা ইল্লাল্লাহু উয়া আসহাদু আন্না মুহাম্মাদান আবদু হুয়া রাসুলুহু )\n\n"
          "প্রতিয়মান আসহাদু আল্লাহ ইলাহা বলে শাহাদাত আঙ্গুলি উপরের দিকে ধাবমান করতে হবে।\nতার পড় (আল্লাহুম্মা সাল্লিয়ালা মুহাম্মাদিউ উয়ালা আলি মুহাম্মাদ কামা সাল্লাইতা আলা ইব্রাহিমা উয়ালা আলি ইব্রাহিম ইন্নাকা হামিদুম্মাজিদ)(আল্লাহুম্ম বারিক আলা মুহাম্মাদিউ উয়ালা আলি মুহাম্মাদ কামা বারাক তা আলা ইব্রাহিমা উয়ালা আলি ইব্রাহিম ইন্নাকা হামিদুম্মাজিদ)\n\n(আল্লাহুম্মা ইন্নি জালামতু নাফসি জুলমান কাছিরা উয়ালা ইয়াগফিরু জুনুবা ইল্লা আনতা ফাগফিরিলি মাগফিরাতাম মিন হিমদিকা উয়ার হামনি ইন্নাকা আনতাল গাফুরুররাহিম) বলে সালাম ফিরাতে হবে।\n\nপ্রথমে আসসালামুয়ালাইকুম উয়া রাহমাতুল্লাহ বলে ডান দিকে পরে বাম দিকে মস্তক ঘুরাতে হবে ।\n\n"
    },
    {
      "name": "ফজর এর নামাজ",
      "arobic": "কিভাবে ফজরের নামাজ পড়বেন"
          "    বিসমিল্লাহির রাহমানির রাহিম\n\nআসসালামুয়ালাইকুম উয়া রাহমাতুল্লাহ।\nমহান আল্লাহ রাব্বুল আলামিনের দরবারে অশেষ মেহেরবানি যিনি এই আসমান,জমিন লৌহ কলম সৃষ্টি করেছেন।\n\nআমরা একমাত্র তারই এবাদত করি। আর এই ইবাদাতের মূল হচ্ছে নামাজ।\n\nনামাজ এমন একটি ইবাদাত যার দ্বারা অতি সহজে আল্লহর নৈকট্য অর্জন করা যায়। \n\nনামাজ মানে শান্তি,নামাজ মানে বেহেস্ত। যেমনটা আমরা জানি (আসসালাতু মিফতাহুল জান্নাহ, অর্থাৎ,নামাজ বেহেস্তের চাবি) অন্যভাবে বলতে গেলে নামাজ হচ্ছে দিনের খুটি (আসসালাতু ইমাদুদ্দিন)। \n\nমহান আল্লাহ পাক রাব্বুল আলামিন নামাজকে অতিব গুরুত্ব দেওয়ার কথা বলেছেন। \n\nআর আজকে নামাজ এর স্বয়ং সম্পুর্ণ বিষয়াবলি নিয়ে আলোচনা করা হলো। \n\nনামাজ মূলত হচ্ছে ৫ ওয়াক্ত যা ফরজ এমনকি বাধ্যতামূলক। \n\nপরবর্তিতে যে গুলা প্রয়োজনীয় যেমন, জুময়ার নামাজ, জানাযার নামাজ এগুলো নিয়েও পর্যায়ক্রমে আলোচনা করা হলো।\n\n১। ফজরঃ ফজরের নামাজ হচ্ছে সকল নামাজের মূল। \nফজরের নামাজের অনেক ফজিলত রয়েছে। তার মধ্যে একটি হলো ফজরের নামাজ মানুষের চেহারার সৌন্দর্য বৃদ্ধি করে।\n\n"
          "    সময়ঃ সূর্যদয়ের ২৩ মিনিট পুর্ব পর্যন্ত। \nঅর্থাৎ তাহাজ্জুতের নামাজের পর থেকে শুরু। সাধারন ভাবে রাত ১২টার পর থেকে ফজরের নামাজের সময় শুরু হয়।\n\n"
          "    নিয়মঃ ফজরের নামাজ ৪ রাকাত। ২ রাকাত সুন্নত এবং ২ রাকাত ফরজ।\n\n"
          "    ২ রাকাত সুন্নত নামাজ পড়ার নিয়ম হলোঃ প্রথমে অজু করে জায় নামাজে দাড়াতে হবে।\n\n"
          "    দোয়া পরতে হবে -জায়নামাজের । \n\n(ইন্নি উয়াজ্জাহতু উয়াজহিয়া লিল্লাজি ফাতারা সসামাওয়াতি উয়াল আরদ্বি হানিফা উয়ামা আনা মিনাল মুশরিকিন)।\n\n"
          "    নিয়তঃ তারপর নিয়ত করতে হবে, \n\n(নাওয়াইতু আন উসাল্লিয়া লিল্লাহিতায়ালা রাকাতাই সালাতি ফাজরি সুন্নাতু রাসুলিল্লাহি তায়ালা মুতাওয়াজ্জিহান ইলা জিহাতিল ক্বাবাতিশ শারিফাতি আল্লাহু আকবার) বলে রাকাত বাধতে হবে।\n\nদুই হাত কাধ বরাবর নিয়ে যাতে হাতের তালু দুইটি কাবার দিকে থাকে তারপর হাত নামিয়ে নাভির নিচে অথবা নাভির উপরে বাধতে হবে।\n\n"
          "    অতঃপর পড়তে হবে (সুবহানাকা আল্লাহুম্মা বিহামদিকা উতাওয়া রাকাসমুকা উয়াতায়ালা জাদ্দুকা উয়ালা ইলাহা গাইরুক)। \n\nতারপর সুরা ফাতিহা পড়তে হবে (আলহামদু লিল্লাহি রাব্বিল আলামিন, আররাহমানির রাহিম,মা-লিকিয়াউ মিদ্দিন, ইয়া কানা বুদু উয়া ইয়া কানাসতায়িন,\n\nইহদিনাসসিরাতাল মুস্তাকিম, সিইরা ত্বাল্লাজিনা আন আম তায়ালাইহিম, ঘাইরিল মাগদু বিয়ালাইহিম, উয়ালাদ্দুয়াল্লিন, আমিন) \n\nএর পর যে কোন একটি সূরা পড়তে হবে \n\n"
          "    তারপর আল্লাহু আকবার বলে রুকুতে যেতে হবে।\nরুকুতে গিয়ে পড়তে হবে { সুবহানা রাব্বিয়াল আযিম (৩ বার উত্তম, এর থেকে বেশি পড়লে ভাল)} সামিয়াল্লাহুলিমান হামিদা বলে রুকু থেকে উঠতে হবে।\n\nসোজা হয়ে দাড়াতে হবে। তারপর আবার আল্লহু আকবার বলে সিজদায় যেতে হবে। (সিজদার নিয়ম হচ্ছে প্রথমে পায়ের পাতা থেকে কোমর পর্যন্ত সোজা রেখে দেহটাকে নিচের দিকে ঝুকিয়ে পরবর্তিতে হাটু ঝুকিয়ে প্রথমে নাক পরে কপাল মাঠিতে লাগানো)\n\n"
          "    সিজদায় গিয়ে পড়তে হবে (সুবহানা রাব্বিয়াল আলা,  ঠিক আগের মতো, ৩ বার উত্তম, বেশি পড়লে ভালো)। \n\nআল্লাহু আকবার বলে সিজদাহ থেকে বসা, সিজদা দুটি দিতে হয়। সেজন্য আল্লাহু আকবার বলে সিজদাহ থেকে বসা অবস্তায় তারপর আবার সিজদায় যেতে হবে।\n\nএবং ২য় সেজদায় আগের মতোই হবে (সুবহানা রাব্বিয়াল আলা,  ঠিক আগের মতো, ৩ বার উত্তম, বেশি পড়লে ভালো) বলতে হবে। তবে এখানে উল্লেখ দুই সেজদার মাঝে এই দোয়াটি পড়তে হবে।\n\nদোয়াটি পড়তে এই লিংকে ক্লিক করুন। তারপর আল্লাহু আকবার বলে দাড়িয়ে যেতে হবে।\n\n"

          //==============
          "    শেষ রাকাতের নিয়ম"
          "    আবার ঠিক আগের মতোই সূরা ফাতিহা এবং তার সাথে মিলিয়ে যে কোন একটি সুরা পড়তে হবে।\n\nতার পর রুকুতে যেতে হবে রুকু গিয়ে (সুবহানা রাব্বিয়াল আযিম) (৩ বার উত্তম, এর থেকে বেশি পড়লে ভাল)}\n\nতারপর সামিয়াল্লাহুলিমান হামিদা বলে দাড়াতে হবে। \nআল্লাহু আকবার বলে সিজদায় যেতে হবে। সিজদায় গিয়ে ঠিক আগের মতোই (সুবহানা রাব্বিয়াল আলা) তারপর আল্লাহু আকবার বলে প্রথম বার বসতে হবে। \nতার পর দ্বিতীয় বার সেজদায় সেতে হবে (প্রথম রাকাতের মতোই) ।\n\n"
          "এখন দ্বিতীয় বারে দ্বিতীয় রাকাতে বসে পড়তে হবে।\nঅর্থাৎ ২য় রাকাতের সেজদা উঠে থেকে বসতে হবে। \n\nতারপর বসেই পড়তে হবে (আত্তাহিয়াতু লিল্লাহি উয়াসসালাউয়াতু উয়াত্তাইয়িবাতি আসসালামু আলাইকা আইয়ু হান্নাবিয়ু উউয়া রাহমাতুল্লাহি উয়া বারাকাতুহু আসসালামু আলাইনা আলা ইবাদিল্লাহিস সুয়ালিহিন, আসহাদু আল্লাহ ইলাহা ইল্লাল্লাহু উয়া আসহাদু আন্না মুহাম্মাদান আবদু হুয়া রাসুলুহু )\n\n"
          "প্রতিয়মান আসহাদু আল্লাহ ইলাহা বলে শাহাদাত আঙ্গুলি উপরের দিকে ধাবমান করতে হবে।\nতার পড় (আল্লাহুম্মা সাল্লিয়ালা মুহাম্মাদিউ উয়ালা আলি মুহাম্মাদ কামা সাল্লাইতা আলা ইব্রাহিমা উয়ালা আলি ইব্রাহিম ইন্নাকা হামিদুম্মাজিদ)(আল্লাহুম্ম বারিক আলা মুহাম্মাদিউ উয়ালা আলি মুহাম্মাদ কামা বারাক তা আলা ইব্রাহিমা উয়ালা আলি ইব্রাহিম ইন্নাকা হামিদুম্মাজিদ)\n\n(আল্লাহুম্মা ইন্নি জালামতু নাফসি জুলমান কাছিরা উয়ালা ইয়াগফিরু জুনুবা ইল্লা আনতা ফাগফিরিলি মাগফিরাতাম মিন হিমদিকা উয়ার হামনি ইন্নাকা আনতাল গাফুরুররাহিম) বলে সালাম ফিরাতে হবে।\n\nপ্রথমে আসসালামুয়ালাইকুম উয়া রাহমাতুল্লাহ বলে ডান দিকে পরে বাম দিকে মস্তক ঘুরাতে হবে ।\n\n"

          //==============
          "ফরজ দুই রাকাতের নিয়ম ও নিয়ত"
          "২ রাকাত ফরজ নামাজ পড়ার নিয়ম হলোঃ \n\n২ সুন্নত এর মতই ফরজ ২ রাকাত পড়তে হয়।\n\nনিয়ম প্রায় একই , কিছু পার্থক্য নিয়ত পড়ার মধ্যে আছে। যাইহোক তারপর ও পুরো বিস্তারিত বলছি।\n\n"
          "প্রথমে অজু করে জায়নামাজে দাড়াতে হবে।\nজায়নামাজের দোয়া পরতে হবে। (ইন্নি উয়াজ্জাহতু উয়াজহিয়া লিল্লাজি ফাতারাসসামাওয়াতি উয়াল আরদ্বি হানিফা উয়ামা আনা মিনাল মুশরিকিন)।\n\n"
          "তার পর নিয়ত করতে হবে, \n(নাওয়াইতু আন উসাল্লিয়া লিল্লাহিতায়ালা রাকাতাই সালাতি ফাজরি ফারদুল্লাহি তায়ালা \nইমামের পিছনে পড়লে’ইকতা দাইতু বিহাজাল ইমাম অথবা ইমামতি করলে আনা ইমামু লিমান হাদ্বারা উয়ামাইন ইয়াহদুরু\n\nমুতাওয়াজ্জিহান ইলা জিহাতিল ক্বাবাতিশ শারিফাতি আল্লাহু আকবার)বলে রাকাত বাধতে হবে।\n\n"
          "দুই হাত কাধ বরাবর নিয়ে যাতে হাতের তালু দুইটি কাবার দিকে থাকে তার পর হাত নামিয়ে নাভির নিচে অথবা নাভির উপরে বাধতে হবে ।\n\nপড়তে হবে (সুবহানাকা আল্লাহুম্মা বিহামদিকা উতাওয়া রাকাসমুকা উয়াতায়ালা জাদ্দুকা উয়ালা ইলাহা গাইরুক)।\nতার পর সুরা ফাতিহা পড়তে হবে (আলহামদু লিল্লাহি রাব্বিল আলামিন, আররাহমানির রাহিম,মা-লিকিয়াউ মিদ্দিন, ইয়া কানা’ বুদু উয়া ইয়া কানাসতায়িন, ইহদিনাসসিরাতাল মুস্তাকিম, সইরা ত্বাল্লাজিনা আন আম তায়ালাইহিম, ঘাইরিল মাগদু বিয়ালাইহিম, উয়ালাদ্দুয়াল্লিন,) \n\nএরপর যে কোন একটি সূরা পড়তে হবে।\n\n"
          "তারপর আল্লাহু আকবার বলে রুকুতে যেতে হবে।\nরুকুতে গিয়ে পড়তে হবে { সুবহানা রাব্বিয়াল আযিম (৩ বার উত্তম, বেশি পড়লে ভাল)} \n\nসামিয়াল্লাহুলিমান হামিদা বলে রুকু থেকে উটতে হবে। আবার আল্লহু আকবার বলে সিজদায় যেতে হবে।\n\n(সিজদার নিয়ম হচ্চে প্রথমে পায়ের পাতা থেকে কোমর পর্যন্ত সোজা রেখে দেহটাকে নিচের দিকে ঝুকিয়ে পরবর্তিতে হাটু ঝুকিয়ে প্রথমে নাক পরে কপাল মাঠিতে লাগানো) সিজদায় গিয়ে পড়তে হবে (সুবহানা রাব্বিয়াল আলা, ঠিক আগের মতো, ৩বার উত্তম, বেশি পড়লে ভাল)। \n\nআল্লাহু আকবার বলে সিজদাহ থেকে বসা অবস্তায় তার পর আবার সিজদায় যেতে হবে। আগের মতোই বলতে হবে। তারপর আল্লাহু আকবার বলে দাড়িয়ে যেতে হবে।\n\n",
      "bangla": "",
      "anubat": ""
    },
    {"name": "যুহর এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "আসর এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "মাগরিব এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "এশা এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "তাহাজ্জুদ এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "ইশরাক এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "যাওয়াল এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "জানাজার এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {"name": "তারাবির এর নামাজ", "arobic": "", "bangla": "", "anubat": ""},
    {
      "name": "মহিলাদের নামাজ পড়ার নিয়ম",
      "arobic": "",
      "bangla": "",
      "anubat": ""
    },
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        systemOverlayStyle: SystemUiOverlayStyle(
          statusBarColor: HexColor("#254C27"),
        ),
        backgroundColor: HexColor("#254C27"),
        leading: InkWell(
          onTap: () {
            Navigator.pop(context);
          },
          child: Icon(Icons.arrow_back_ios),
        ),
        title: Text("নামাজ শিক্ষা"),
        centerTitle: true,
      ),
      body: SizedBox(
        height: double.infinity,
        child: ListView.builder(
            scrollDirection: Axis.vertical,
            itemCount: namajSikkhaData.length,
            itemBuilder: (BuildContext context, int index) {
              return InkWell(
                onTap: () {
                  Get.toNamed(RoutesName.namajDetalisPage, arguments: [
                    namajSikkhaData[index]["name"].toString(),
                    namajSikkhaData[index]['arobic'].toString(),
                    namajSikkhaData[index]['bangla'].toString(),
                    namajSikkhaData[index]['anubat'].toString(),
                  ]);
                },
                child: Card(
                    color: Colors.white,
                    child: Padding(
                      padding: const EdgeInsets.only(
                          top: 10, bottom: 10, left: 20, right: 10),
                      child: Text(
                        namajSikkhaData[index]['name'].toString(),
                        style: TextStyle(
                            color: HexColor("#254C27"),
                            fontSize: 18,
                            fontWeight: FontWeight.bold),
                      ),
                    )),
              );
            }),
      ),
    );
  }
}
