import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:get/get.dart';
import 'package:get/get_core/src/get_main.dart';
import 'package:hexcolor/hexcolor.dart';

import '../routes/routes_name.dart';

class HojOmraPage extends StatefulWidget {
  const HojOmraPage({super.key});

  @override
  State<HojOmraPage> createState() => _HojOmraPageState();
}

class _HojOmraPageState extends State<HojOmraPage> {
  var data_list = [
    {
      "name": "হজ ও ওমরার মাঝে পার্থক্য কী?",
      "arobic": "",
      "bangla": "হজ ও ওমরা গুরুত্বপূর্ণ ইবাদতগুলোর একটি। ইসলামের যে মূল পাঁচটি স্তম্ভ রয়েছে, যার কোনও একটি অস্বীকার করলে একজন মানুষ মুসলমান থাকে না, তার একটি হজ। অপরদিকে ওমরা হলো সুন্নত ইবাদতের অন্তভূর্ক্ত। এ বিষয়ে হজরত জাবের (রা.) থেকে বর্ণিত হাদিস এসেছে, ওমরা করা ওয়াজিব কি-না রাসূলুল্লাহ (সা.)-কে জিজ্ঞাসা করা হলে উত্তরে তিনি বলেছেন, না; তবে যদি ওমরা করো তা হবে উত্তম। -(আহমদ, তিরমিজি, ৯৩১)",
      "anubat": ""
    },
    {
      "name": "কোরআন ও হাদিসে ওমরা প্রসঙ্গ",
      "arobic": "",
      "bangla": "ওমরা প্রসঙ্গে কোরআনে কারিমে ইরশাদ হয়েছে, ‘নিশ্চয় সাফা ও মারওয়া আল্লাহর নিদর্শনাবলির অন্যতম, তাই যারা হজ করবে বা ওমরা করবে; তারা এতদুভয়ের প্রদক্ষিণ (সাঈ) করবে।’ –(সূরা বাকারা: ১৫৮)\n\n\nঅন্যত্র বর্ণিত হয়েছে, ‘আর তোমরা আল্লাহর উদ্দেশ্যে হজ ও ওমরাহ পরিপূর্ণ ভাবে পালন কর।’ -(সূরা বাকারাহ; আয়াত ১৯৬ এর প্রথম অংশ)।",
      "anubat":
          ""
    },
    {
      "name": "ওমরার ফজিলত",
      "arobic": "",
      "bangla": "হজরত আবু হুরায়রা (রা.) সূত্রে বর্ণিত; তিনি বলেন, রাসুল (সা.) বলেছেন, ‘এক ওমরাহ থেকে পরবর্তী ওমরাহ পর্যন্ত মাঝখানের গোনাহগুলোর জন্য কাফফারা স্বরূপ।’ (বোখারি: ১৬৮৩, মুসলিম: ৩৩৫৫)।\n\n\n"
"বার বার হজ , ওমরাহ করা জরুরি নয়। তবে সামর্থ্য থাকলে বার বার হজ, ওমরাহ করা যেতে পারে। কেননা, হাদিসে হজ-ওমরাহ বার বার করার ফজিলত বর্ণিত হয়েছে।\n\n\n"
"আবদুল্লাহ ইবনে মাসউদ (রা.) সূত্রে বর্ণিত; তিনি বলেন, রাসুল (সা.) বলেছেন, ‘তোমরা হজ ও ওমরাহ একটার পর অপরটা করো। কেননা, হজ ও ওমরাহ দারিদ্র্য বিমোচন ও গোনাহ দূর করে দেয় ঠিক সেভাবে, যেভাবে হাঁপরের আগুন লোহা, সোনা ও রুপা থেকে ময়লা দূর করে দেয়।’ (তিরমিজি: ৮১০)।",
      "anubat": ""
    },

    {
      "name": "পরিভাষায় ওমরা",
      "arobic": "",
      "bangla": "ইসলামি শরিয়তের পরিভাষায় ওমরা বলা হয়, নিয়ত করে ইহরামসহ কাবা শরিফের চারপাশ সাতবার তাওয়াফ, সাফা-মারওয়া পাহাড়দ্বয়ের মাঝে সাতবার সাঈ করা এবং মাথা মুণ্ডানোকে।"
      "\n\nহজ নির্দিষ্ট সময়ে আদায় করা আবশ্যক হলেও ওমরা পালনের বিশেষ কোনো সময় নেই। তবে হজের নির্ধারিত বিশেষ সময়ে (৮ জিলহজ থেকে ১২ জিলহজ পর্যন্ত পাঁচ দিন) ওমরা পালন করা বিধেয় নয়। এই পাঁচ দিন ছাড়া বছরের যেকোনো দিন যেকোনো সময় ওমরা পালন করা যায়। "
      "\n\nএকই সফরে একাধিক ওমরা করতে কোনো বাধা নেই। হজের আগেও (হজ না করেও) ওমরা করা যায় এবং হজের পরও বারবার ওমরা করা যায়। তবে রমজান মাসে ওমরা পালনে হজের সমান সওয়াব মিলে। আর শাওয়াল মাস ওমরা করার উত্তম সময়।",
      "anubat": ""
    },

    {
      "name": "হজ ও ওমরার পার্থক্য",
      "arobic": "",
      "bangla": "হজ ও ওমরার মধ্যে অনেক ধরনের পার্থক্য বিদ্যমান। হজ ফরজ থাকা অবস্থায় তা আদায়ের সুযোগ থাকা সত্ত্বেও হজ সম্পন্ন না করে বারবার ওমরা করা অযৌক্তিক। কারণ, শত-সহস্র ওমরা হজের সমকক্ষ নয়। অনুরূপভাবে ওমরা আদায় করলে হজ ফরজ হয়ে যায়, এমনটিও সঠিক নয়। হজ যেমন জীবনে একবার করা ফরজ, তেমনি ওমরা জীবনে অন্তত একবার করা সুন্নত।",
      "anubat": ""
    },

    {
      "name": "এখানে পার্থক্যগুলো তুলে ধরা হলো-",
      "arobic": "",
      "bangla": "১. হজ ফরজ; প্রত্যেক মুসলমানের জন্য তাদের জীবনকালে এটি পালন করা বাধ্যতামূলক যদি তারা শারীরিকভাবে উপযুক্ত এবং আর্থিকভাবে এটি করতে সক্ষম হয়। পক্ষান্তরে ওমরাহ সুন্নত।"

"\n\n২. হজ এক নির্দিষ্ট সময়ে করতে হয় কিন্তু ওমরাহ বৎসরে যে কোন সময়ই করা যায়। তবে ৯ জিলহজ থেকে ১৩ জিলহজ পর্যন্ত ওমরাহ করা মাকরূহ।"

"\n\n৩. ওমরাহর মধ্যে আরাফাত ও মুযদালিফায় অবস্থান, দু’নামাজ এক সাথে আদায় করা ও খুতবার বিধান নেই। তাওয়াফে কুদূম এবং তাওয়াফে বিদা’ও নেই কিন্তু এই সব কাজ হজের মধ্যে রয়েছে।"

"\n\n৪. ওমরাহর মধ্যে তাওয়াফ আরম্ভ করার সময় তালবিয়াহ পড়া মওকুফ করা হয়। আর হজের মধ্যে জামরাতুল আক্বাবাহ’তে রামী (কংকর নিক্ষেপ) করার সময় মওকূফ করা হয়।"

"\n\n৫. ওমরাহ নষ্ট হলে বা জানাবত (ওই নাপাকী যা দ্বারা গোসল ফরয হয়) অবস্থায় তাওয়াফ করলে (দম হিসেবে) একটা ছাগল বা মেষ জবেহ করা যথেষ্ট, কিন্তু হজে তা যথেষ্ট নয় বরং পরবর্তী বছর পুনরায় সম্পন্ন করতে হয়।",
      "anubat": ""
    },

  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        systemOverlayStyle: SystemUiOverlayStyle(
          statusBarColor: HexColor("#254C27"),
        ),
        backgroundColor: HexColor("#254C27"),
        leading: InkWell(
          onTap: () {
            Navigator.pop(context);
          },
          child: Icon(Icons.arrow_back_ios),
        ),
        title: Text("হজ্জ ও উমরা"),
        centerTitle: true,
      ),
      body: ListView.builder(
          scrollDirection: Axis.vertical,
          itemCount: data_list.length,
          itemBuilder: (BuildContext context, int index) {

            return InkWell(
              onTap: (){
                Get.toNamed(RoutesName.hojumradetailsPage,arguments: [
                  data_list[index]['name'].toString(),
                  data_list[index]['arobic'].toString(),
                  data_list[index]['bangla'].toString(),
                  data_list[index]['anubat'].toString(),

                ]);

              },
              child: Card(
                  color: Colors.white,
                  child: Padding(
                    padding: const EdgeInsets.only(
                        top: 20, bottom: 20, left: 20, right: 10),
                    child: Text(
                      data_list[index]['name'].toString(),
                      style: TextStyle(
                          color: HexColor("#254C27"),
                          fontSize: 18,
                          fontWeight: FontWeight.bold),
                    ),
                  )),
            );
          }),
    );
  }
}
