import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:get/get.dart';
import 'package:get/get_core/src/get_main.dart';
import 'package:hexcolor/hexcolor.dart';

import '../routes/routes_name.dart';

class RojaPage extends StatefulWidget {
  const RojaPage({super.key});

  @override
  State<RojaPage> createState() => _RojaPageState();
}

class _RojaPageState extends State<RojaPage> {
  var rojalistData = [
    {
      "name": "রোজার উচ্চ মর্যাদা ও ফজিলত",
      "arobic": "",
      "bangla":
          "ইসলামের ভিত্তি পাঁচটি। চতুর্থটি হচ্ছে রমজান মাসজুড়ে রোজা রাখা। \nইসলামের পাঁচটি ভিত্তির প্রতিটি পালনেই রয়েছে উচ্চ মর্যাদা ও ফজিলতের ঘোষণা।\n\n\nতবে রমজানের উচ্চ মর্যাদা, ফজিলত ও বৈশিষ্ট্য অন্য ইবাদতগুলোর চেয়ে ভিন্ন। কারণ হাদিসে কুদসিতে নবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের ঘোষণাই তা প্রমাণ করে-\n\n يَقُولُ اللَّهُ عَزَّ وَجَلَّ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ يَدَعُ شَهْوَتَهُ وَأَكْلَهُ وَشُرْبَهُ مِنْ أَجْلِي، وَالصَّوْمُ جُنَّةٌ، وَلِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ حِينَ يُفْطِرُ وَفَرْحَةٌ حِينَ يَلْقَى رَبَّهُ، وَلَخَلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \n\n\nআল্লাহ তাআল বলেন,\n\nমানুষের অন্য সব আমল তার নিজের জন্য, কিন্তু রোজা একান্তই আমার জন্য এবং আমি এর জন্য তাকে পুরস্কৃত করব।\n\n রোজা ঢালস্বরূপ। \n\nতার নামে বলছি, যার হাতে মুহাম্মদের জীবন, রোজাদারের মুখের গন্ধ আল্লাহর কাছে মেশকের গন্ধের চেয়েও পবিত্র। \n\n\nএকজন রোজাদার দু’টি আনন্দ লাভ করে।\n\nসে আনন্দিত হয় যখন সে ইফতার করে এবং রোজার কল্যাণে সে আনন্দিত হয় যখন সে তার প্রভুর সাথে মিলিত হয়।’ \n(বুখারি)\n\n\n\nরমজানের রোজা বান্দার জন্য মহান আল্লাহর একান্ত অনুগ্রহ।\n\nমানুষ এ মাসে আল্লাহর ভালোবাসায় তার হুকুম পালনে অন্য সময়ের বৈধ কাজ থেকেও বিরত থাকে।\n অন্য সব রোজা থেকে আল্লাহর ফরজ করা রমজান মাসের নির্ধারিত রোজার মর্যাদা অনেক বেশি।\n\nকেননা এ মাসের রোজা আল্লাহর কোরআন, প্রিয়নবির হাদিস ও মুসলিম উম্মাহর সর্বসম্মতিক্রমে কেয়ামত পর্যন্ত পালন করা ফরজ। \n\n\nআগের সব নবি-রাসুলের অনুসারিদের জন্যও রোজা ফরজ ছিল।\n\nকোরআনে পাকে আল্লাহ বলেন-\n\n یٰۤاَیُّهَا الَّذِیۡنَ اٰمَنُوۡا کُتِبَ عَلَیۡکُمُ الصِّیَامُ کَمَا کُتِبَ عَلَی الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّکُمۡ تَتَّقُوۡنَ \n\n‘হে ঈমানদারগণ! তোমাদের ওপর সিয়াম বা রোজা ফরজ করা হয়েছে;\n\n যেভাবে তোমাদের পূর্ববর্তীদের ওপর ফরজ করা হয়েছিল; যাতে তোমরা তাকওয়া (আত্মশুদ্ধি) অর্জনে করতে পার। (সুরা বাকারা : আয়াত ১৮৩) \n\nআল্লাহ তাআলা মুসলিম উম্মাহকে উচ্চ মর্যাদা দেয়ার লক্ষ্যে রমজানজুড়ে রোজা রাখা ফরজ করে দিয়েছেন। \n\nআল্লাহ তাআলা বলেন-\n شَهۡرُ رَمَضَانَ الَّذِیۡۤ اُنۡزِلَ فِیۡهِ الۡقُرۡاٰنُ هُدًی لِّلنَّاسِ وَ بَیِّنٰتٍ مِّنَ الۡهُدٰی وَ الۡفُرۡقَانِ ۚ فَمَنۡ شَهِدَ مِنۡکُمُ الشَّهۡرَ فَلۡیَصُمۡهُ ؕ \n\n‘রমজান মাস, যে মাসে পবিত্র কোরআন নাজিল হয়েছে। \n\nযা মানব জাতির জন্য পথ প্রদর্শক আর তাতে রয়েছে হেদায়েতের নিদর্শনসমূহ এবং যা হক ও বাতিলের পার্থক্যকারী। \n\nঅতএব তোমাদের মধ্যে যে কেউ এ মাস পাবে, তাকে অবশ্যই রোজা রাখতে হবে।’ \n\n(সুরা বাকারা : আয়াত ১৮৫) রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, \n\n‘ইসলামের ভিত্তি হচ্ছে পাঁচটি। \n\nএকথা সাক্ষ্য দেয়া যে, \n\nআল্লাহ ছাড়া কোনো মাবুদ নেই,\n\n\n হজরত মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম আল্লাহর রাসুল; \n\nনামাজ প্রতিষ্ঠা করা; জাকাত আদায় করা; \n\nরমজানের রোজা রাখা এবং সামর্থ্য থাকলে বাইতুল্লায় হজ করা।’ (বুখারি, মুসলিম, তিরমিজি, নাসাঈ) \n\n রমজানের রোজার উচ্চ মর্যাদার ঘোষণা দিয়েছেন নবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম।\n\nহাদিসে পাকে এসেছে- হজরত তালহা ইবনে আবদুল্লাহ রাদিয়াল্লাহু আনহু বর্ণনা করেন, \n\n‘এক ব্যক্তি আল্লাহর রাসুলকে জিজ্ঞাসা করেন, \nহে আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম! \nআমার ওপর আল্লাহ কি কি রোজা ফরজ করেছেন, তা আমাকে বলে দিন।\nনবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম জবাবে বললেন, ‘রমজান মাসের রোজা।’ লোকটি পুনরায় জিজ্ঞাসা করলো,\n\nএ ছাড়া অন্য কিছু কি আমার কর্তব্য আছে? প্রিয়নবি বললেন,\n\n ‘না, তবে তুমি যদি নফল রোজা রাখ, তাহলে ভিন্ন কথা।\n\n’ (বুখারি ও মুসলিম) রমজানের রোজার উচ্চ মর্যাদার কারণ রমজান মাসের এমন অনেক উচ্চ মর্যাদা ও বৈশিষ্ট্য রয়েছে যা অন্য কোনো মাসে নেই।\n\nকোরআন-হাদিসের বিভিন্ন স্থানে রোজা পালনের যেসব উচ্চ মর্যাদা ও বৈশিষ্ট্যের বর্ণনা রয়েছে তার কিছু তুলে ধরা হলো- \n\n এ মাসের নাম পবিত্র কোরআন মাজিদে উল্লেখ করা হয়েছে। (সুরা বাকারা : আয়াত ১৮৫) > মহান আল্লাহ এ মাসের রোজা ফরজ করেছেন। \n(সুরা বাকারা : আয়াত ১৮৫)\n\n\n আবার এ মাসেই পবিত্র কোরআনুল কারিম নাজিল করা হয়েছে।\n(সুরা বাকারা : আয়াত ১৮৫) \n\n এ মাসের ইবাদত বন্দেগির ব্যাপারে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সাহাবাদের সুসংবাদ দিতেন। \n\nরজব ও শাবন মাস জুড়ে রমজানের ইবাদত-বন্দেগির জন্য নিজেকে তৈরি করতেন,\n দোয়া পড়তেন এবং সাহাবায়ে কেরামকে দোয়া করতে বলতেন।\n\n\nরমজান মাসে রহমত ও বরকত অবতীর্ণ হয়। \n\n\nএ মাসের জান্নাতের দরজা খুলে দেয়া হয়, জাহান্নামের দরজা বন্ধ রাখা হয় এবং শয়তানকে বন্দী করে রাখা হয়।\n\n\nরমজানের রাত ও দিনে মুসলমানের দোয়া অনবরত আল্লাহর দরবারে কবুল করা হয়।\n\n কোরআনের ঘোষণায় এ মাসের রয়েছে বরকতময় লাইলাতুল কদর। \n\n\n এ মাসের প্রতি রাতে ক্ষমা লাভে ফেরেশতারা মানুষকে আহ্বান করতে থাকে।  \n\nএ পবিত্র মাসেই আল্লাহ তাআলা মুসলমানদের প্রথম সমর অভিযান বদরে বিজয় দান করেছিলেন। \n\n\n রমজান মাসে উমরা আদায় আল্লাহর রাসুলের সঙ্গে হজ পালনের সাওয়াব পাওয়া যায়। \n\nসর্বোপরি মুসলিম উম্মাহ কোরআন ও হাদিসের আলোক একমত যে, রমজানের রোজা ফরজ।\n\nতা ইসলামের পঞ্চ স্তম্ভের অন্যতম একটি। \n\n\nসুতরাং যে কেউ পবিত্র রমজান মাসের রোজা অস্বীকার করবে সে ইসলামকে ইসলামকে অস্বীকারকারী হিসেবে পরিগণিত হবে।\n",
      "anubat": ""
    },
    {
      "name": "রোজার মর্যাদা ঘোষণা",
      "arobic": "",
      "bangla":
          "ইসলামের ভিত্তি পাঁচটি। চতুর্থটি হচ্ছে রমজান মাসজুড়ে রোজা রাখা। \nইসলামের পাঁচটি ভিত্তির প্রতিটি পালনেই রয়েছে উচ্চ মর্যাদা ও ফজিলতের ঘোষণা।\n\nতবে রমজানের উচ্চ মর্যাদা, ফজিলত ও বৈশিষ্ট্য অন্য ইবাদতগুলোর চেয়ে ভিন্ন। কারণ হাদিসে কুদসিতে নবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের ঘোষণাই তা প্রমাণ করে-\n\n يَقُولُ اللَّهُ عَزَّ وَجَلَّ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ يَدَعُ شَهْوَتَهُ وَأَكْلَهُ وَشُرْبَهُ مِنْ أَجْلِي، وَالصَّوْمُ جُنَّةٌ، وَلِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ حِينَ يُفْطِرُ وَفَرْحَةٌ حِينَ يَلْقَى رَبَّهُ، وَلَخَلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \n\n‘আল্লাহ তাআল বলেন, মানুষের অন্য সব আমল তার নিজের জন্য, কিন্তু রোজা একান্তই আমার জন্য এবং আমি এর জন্য তাকে পুরস্কৃত করব। রোজা ঢালস্বরূপ। তার নামে বলছি, যার হাতে মুহাম্মদের জীবন, রোজাদারের মুখের গন্ধ আল্লাহর কাছে মেশকের গন্ধের চেয়েও পবিত্র। একজন রোজাদার দু’টি আনন্দ লাভ করে। সে আনন্দিত হয় যখন সে ইফতার করে এবং রোজার কল্যাণে সে আনন্দিত হয় যখন সে তার প্রভুর সাথে মিলিত হয়।’ \n(বুখারি) \n\nরমজানের রোজা বান্দার জন্য মহান আল্লাহর একান্ত অনুগ্রহ।\nমানুষ এ মাসে আল্লাহর ভালোবাসায় তার হুকুম পালনে অন্য সময়ের বৈধ কাজ থেকেও বিরত থাকে। অন্য সব রোজা থেকে আল্লাহর ফরজ করা রমজান মাসের নির্ধারিত রোজার মর্যাদা অনেক বেশি।\n\nকেননা এ মাসের রোজা আল্লাহর কোরআন, প্রিয়নবির হাদিস ও মুসলিম উম্মাহর সর্বসম্মতিক্রমে কেয়ামত পর্যন্ত পালন করা ফরজ। আগের সব নবি-রাসুলের অনুসারিদের জন্যও রোজা ফরজ ছিল।\n\nকোরআনে পাকে আল্লাহ বলেন-\n\n یٰۤاَیُّهَا الَّذِیۡنَ اٰمَنُوۡا کُتِبَ عَلَیۡکُمُ الصِّیَامُ کَمَا کُتِبَ عَلَی الَّذِیۡنَ مِنۡ قَبۡلِکُمۡ لَعَلَّکُمۡ تَتَّقُوۡنَ \n\n‘হে ঈমানদারগণ! তোমাদের ওপর সিয়াম বা রোজা ফরজ করা হয়েছে;\n\n যেভাবে তোমাদের পূর্ববর্তীদের ওপর ফরজ করা হয়েছিল; যাতে তোমরা তাকওয়া (আত্মশুদ্ধি) অর্জনে করতে পার। (সুরা বাকারা : আয়াত ১৮৩) আল্লাহ তাআলা মুসলিম উম্মাহকে উচ্চ মর্যাদা দেয়ার লক্ষ্যে রমজানজুড়ে রোজা রাখা ফরজ করে দিয়েছেন। \n\nআল্লাহ তাআলা বলেন-\n شَهۡرُ رَمَضَانَ الَّذِیۡۤ اُنۡزِلَ فِیۡهِ الۡقُرۡاٰنُ هُدًی لِّلنَّاسِ وَ بَیِّنٰتٍ مِّنَ الۡهُدٰی وَ الۡفُرۡقَانِ ۚ فَمَنۡ شَهِدَ مِنۡکُمُ الشَّهۡرَ فَلۡیَصُمۡهُ ؕ \n\n‘রমজান মাস, যে মাসে পবিত্র কোরআন নাজিল হয়েছে। যা মানব জাতির জন্য পথ প্রদর্শক আর তাতে রয়েছে হেদায়েতের নিদর্শনসমূহ এবং যা হক ও বাতিলের পার্থক্যকারী। \n\nঅতএব তোমাদের মধ্যে যে কেউ এ মাস পাবে, তাকে অবশ্যই রোজা রাখতে হবে।’ \n\n(সুরা বাকারা : আয়াত ১৮৫) রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, \n‘ইসলামের ভিত্তি হচ্ছে পাঁচটি। একথা সাক্ষ্য দেয়া যে, আল্লাহ ছাড়া কোনো মাবুদ নেই, হজরত মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম আল্লাহর রাসুল; নামাজ প্রতিষ্ঠা করা; জাকাত আদায় করা; রমজানের রোজা রাখা এবং সামর্থ্য থাকলে বাইতুল্লায় হজ করা।’ (বুখারি, মুসলিম, তিরমিজি, নাসাঈ)  রমজানের রোজার উচ্চ মর্যাদার ঘোষণা দিয়েছেন নবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম।\n\nহাদিসে পাকে এসেছে- হজরত তালহা ইবনে আবদুল্লাহ রাদিয়াল্লাহু আনহু বর্ণনা করেন, ‘এক ব্যক্তি আল্লাহর রাসুলকে জিজ্ঞাসা করেন, হে আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম! আমার ওপর আল্লাহ কি কি রোজা ফরজ করেছেন, তা আমাকে বলে দিন।\nনবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম জবাবে বললেন, ‘রমজান মাসের রোজা।’ লোকটি পুনরায় জিজ্ঞাসা করলো, এ ছাড়া অন্য কিছু কি আমার কর্তব্য আছে? প্রিয়নবি বললেন,\n\n ‘না, তবে তুমি যদি নফল রোজা রাখ, তাহলে ভিন্ন কথা।’ (বুখারি ও মুসলিম) রমজানের রোজার উচ্চ মর্যাদার কারণ রমজান মাসের এমন অনেক উচ্চ মর্যাদা ও বৈশিষ্ট্য রয়েছে যা অন্য কোনো মাসে নেই।\n\nকোরআন-হাদিসের বিভিন্ন স্থানে রোজা পালনের যেসব উচ্চ মর্যাদা ও বৈশিষ্ট্যের বর্ণনা রয়েছে তার কিছু তুলে ধরা হলো- >\n\n এ মাসের নাম পবিত্র কোরআন মাজিদে উল্লেখ করা হয়েছে। (সুরা বাকারা : আয়াত ১৮৫) > মহান আল্লাহ এ মাসের রোজা ফরজ করেছেন। \n\n (সুরা বাকারা : আয়াত ১৮৫) > আবার এ মাসেই পবিত্র কোরআনুল কারিম নাজিল করা হয়েছে।\n(সুরা বাকারা : আয়াত ১৮৫) > এ মাসের ইবাদত বন্দেগির ব্যাপারে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম সাহাবাদের সুসংবাদ দিতেন। রজব ও শাবন মাস জুড়ে রমজানের ইবাদত-বন্দেগির জন্য নিজেকে তৈরি করতেন, দোয়া পড়তেন এবং সাহাবায়ে কেরামকে দোয়া করতে বলতেন। > রমজান মাসে রহমত ও বরকত অবতীর্ণ হয়। > এ মাসের জান্নাতের দরজা খুলে দেয়া হয়, জাহান্নামের দরজা বন্ধ রাখা হয় এবং শয়তানকে বন্দী করে রাখা হয়। > রমজানের রাত ও দিনে মুসলমানের দোয়া অনবরত আল্লাহর দরবারে কবুল করা হয়। > কোরআনের ঘোষণায় এ মাসের রয়েছে বরকতময় লাইলাতুল কদর। > এ মাসের প্রতি রাতে ক্ষমা লাভে ফেরেশতারা মানুষকে আহ্বান করতে থাকে। > \n\nএ পবিত্র মাসেই আল্লাহ তাআলা মুসলমানদের প্রথম সমর অভিযান বদরে বিজয় দান করেছিলেন। > রমজান মাসে উমরা আদায় আল্লাহর রাসুলের সঙ্গে হজ পালনের সাওয়াব পাওয়া যায়। সর্বোপরি মুসলিম উম্মাহ কোরআন ও হাদিসের আলোক একমত যে, রমজানের রোজা ফরজ। তা ইসলামের পঞ্চ স্তম্ভের অন্যতম একটি। সুতরাং যে কেউ পবিত্র রমজান মাসের রোজা অস্বীকার করবে সে ইসলামকে ইসলামকে অস্বীকারকারী হিসেবে পরিগণিত হবে।\n",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-১",
      "arobic": " ",
      "bangla":
          "হজরত আবু হুরায়রা (রা.) বর্ণনা করেন, হাদিসে কুদসিতে রাসুলুল্লাহ (সা.) এরশাদ করেন, আল্লাহ তাআলা বলেন,\n ‘আদম সন্তানের প্রত্যেক আমল তার নিজের জন্য—রোজা ব্যতীত। কারণ, রোজা আমার জন্যই এবং আমি নিজেই তার প্রতিদান দেব।’ \n\n(মহানবী সা. আরও বলেন) ‘রোজা ঢাল স্বরূপ। তোমাদের কেউ যেন সিয়াম পালনের দিন অশ্লীলতায় লিপ্ত না হয় এবং ঝগড়া-বিবাদ না করে। যদি কেউ তাকে গালি দেয় অথবা তার সঙ্গে ঝগড়া করে, তাহলে সে যেন বলে, আমি একজন রোজাদার। যাঁর হাতে মুহাম্মদের প্রাণ তাঁর শপথ! \n\nঅবশ্যই রোজাদারের মুখের গন্ধ আল্লাহর কাছে মেশকের সুগন্ধের চেয়েও সুগন্ধময়। রোজাদারের জন্য রয়েছে দুটি খুশির মুহূর্ত আছে, যা তাকে আনন্দিত করে। যখন সে ইফতার করে, সে খুশি হয় এবং যখন সে তার পালনকর্তার সঙ্গে সাক্ষাৎ করবে, \nতখন রোজার বিনিময়ে আনন্দিত হবে।’ (বুখারি, হাদিস: ১৯০৪)",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-২",
      "arobic": " ",
      "bangla":
          "হজরত হুজায়ফা (রা.) বলেন, আমি মহানবী (সা.)-কে বলতে শুনেছি,\n ‘মানুষের পরিবার, ধন-সম্পদ ও প্রতিবেশীর ব্যাপারে ঘটিত বিভিন্ন ফেতনা ও গুনাহর কাফফারা হলো নামাজ, রোজা ও সদকা।’ (বুখারি, হাদিস: ১৮৯৫)",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-৩",
      "arobic": " ",
      "bangla":
          "হজরত সাহল ইবনে সাআদ (রা.) থেকে বর্ণিত, মহানবী (সা.) এরশাদ করেন, \n‘জান্নাতের এক প্রবেশদ্বার রয়েছে, যার নাম রাইয়ান। কিয়ামতের দিন ওই প্রবেশদ্বার দিয়ে রোজাদারগণ প্রবেশ করবে। তারা ছাড়া আর কেউই ও দরজা দিয়ে প্রবেশ করবে না। বলা হবে,\n\n ‘কোথায় রোজাদারগণ?’ সুতরাং তারা ওই দরজা দিয়ে (জান্নাতে) প্রবেশ করবে। এর পর যখন তাদের সর্বশেষ ব্যক্তি প্রবেশ করবে, তখন সেই দরজা বন্ধ করা হবে।\n\n ফলে তা দিয়ে আর কেউই প্রবেশ করতে পারবে না।’ (বুখারি, হাদিস: ১৮৯৬)",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-৪",
      "arobic": " ",
      "bangla":
          "হজরত আবু সাইদ (রা.) বর্ণনা করেন, রাসুলুল্লাহ (সা.) বলেন, \n‘যে বান্দা আল্লাহর পথে একদিন মাত্র রোজা রাখবে, সেই বান্দাকে আল্লাহ বিনিময়ে জাহান্নাম থেকে ৭০ বছরের পথ পরিমাণ দূরত্বে রাখবেন।’ (বুখারি, হাদিস: ২৮৪০)",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-৫",
      "arobic": " ",
      "bangla":
          "হজরত উসমান বিন আবুল আস থেকে বর্ণিত, মহানবী (সা.) এরশাদ করেন,\n ‘রোজা জাহান্নাম থেকে বাঁচার জন্য ঢালস্বরূপ; যেমন যুদ্ধের সময় নিজেকে রক্ষা করার জন্য তোমাদের ঢাল থাকে।’ (মুসনাদে আহমাদ, সহিহুল জামিউস সাগির, হাদিস: ৩৮৭৯)",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-৬",
      "arobic": " ",
      "bangla":
          "হজরত আবদুল্লাহ ইবনে আমর (রা.) থেকে বর্ণিত, রাসুলুল্লাহ (সা.) এরশাদ করেন,\n ‘কিয়ামতের দিন রোজা ও কোরআন বান্দার জন্য সুপারিশ করবে। রোজা বলবে, \n\n‘হে আমার প্রতিপালক, আমি তাকে পানাহার ও যৌনকর্ম থেকে বিরত রেখেছিলাম। সুতরাং তার ব্যাপারে আমার সুপারিশ গ্রহণ করুন।\n\n’ কোরআন বলবে, ‘আমি তাকে রাতের ঘুম থেকে বিরত রেখেছিলাম। সুতরাং তার ব্যাপারে আমার সুপারিশ গ্রহণ করুন।’ মহানবী (সা.) আরও বলেন, ‘অতএব উভয়ের সুপারিশ গৃহীত হবে।’ (মুসনাদে আহমাদ, সহিহ তারগিব, হাদিস: ৯৬৯)",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-৭",
      "arobic": " ",
      "bangla":
          "হজরত আবু উমামা (রা.) বর্ণনা করেন, আমি বললাম, \n‘হে আল্লাহর রাসুল, আমাকে এমন কোনো আমলের আজ্ঞা করুন; যার বিনিময়ে আল্লাহ আমাকে লাভবান করবেন।’\n\n (অন্য এক বর্ণনায় আছে, ‘যার মাধ্যমে আমি জান্নাত যেতে পারব’) তিনি বললেন,\n ‘তুমি রোজা রাখো। কারণ, এর সমতুল্য কিছু নেই।’\n\n পুনরায় আমি বললাম, ‘হে আল্লাহর রাসুল, আমাকে কোনো আমলের আদেশ করুন।’ তিনি পুনরায় একই কথা বললেন, ‘তুমি রোজা রাখো। কারণ, এর সমতুল্য কিছু নেই।’ (নাসায়ি, সহিহ্ তারগিব, হাদিস: ৯৭৩)",
      "anubat": ""
    },
    {
      "name": "রোজার ফজিলত সম্পর্কে হাদিস-৮",
      "arobic": " ",
      "bangla":
          "হজরত হুজায়ফা (রা.) বর্ণনা করেন, মহানবী (সা.) আমার বুকে হেলান দিয়ে ছিলেন। তখন তিনি বললেন, \n‘লা ইলাহা ইল্লাল্লাহ’ বলার পর যে ব্যক্তির জীবনের পরিসমাপ্তি ঘটবে, সে জান্নাতে প্রবেশ করবে। \n\nআল্লাহর সন্তুষ্টি লাভের উদ্দেশ্যে একদিন রোজা রাখার পর যে ব্যক্তির জীবনের পরিসমাপ্তি ঘটবে, \nসে জান্নাতে প্রবেশ করবে। আর আল্লাহর সন্তুষ্টি লাভের আশায় কিছু সদকা করার পর যে ব্যক্তির জীবনের পরিসমাপ্তি ঘটবে, সেও জান্নাত প্রবেশ করবে।’ (মুসনাদে আহমাদ, সহিহ্ তারগিব, হাদিস: ৯৭২)",
      "anubat": ""
    },

    {
      "name": "ইফতারের ফজিলত ও বরক",
      "arobic": "",
      "bangla": "ইফতার অর্থ উপবাস ভঞ্জন করা। ভোর থেকে সারা দিন ‘সাওম’ পালন শেষে সূর্যাস্তের পর প্রথম যে পানাহারের মাধ্যমে উপবাস ভঞ্জন করা হয়, \nতাকে ‘ইফতার’ বলে। \n\nযে খাদ্য বা পানীয় দ্বারা ইফতার করা হয়, তাকে ‘ইফতারি’ বলা হয়। ইফতারের সময় হওয়ার সঙ্গে সঙ্গে ইফতার \n" +
          "করা উত্তম। ইফতারের আগেই ইফতারি সামনে নিয়ে অপেক্ষা করা এবং যথাসময়ে ইফতার করা সুন্নাত। হাদিসে বর্ণিত হয়েছে রোজাদারের দোয়া আল্লাহর কাছে এতই আকর্ষণীয় যে আল্লাহ তাআলা রমজানের সময় ফেরেশতাদের উদ্দেশে ঘোষণা করেন, \n\n‘রমজানে তোমাদের পূর্বের দায়িত্ব মওকুফ করা হলো এবং নতুন দায়িত্বের আদেশ করা হলো, তা হলো আমার রোজাদার বান্দাগণ যখন কোনো দোয়া মোনাজাত করবে, তখন তোমরা আমিন! আমিন!! বলতে থাকবে।’ (মুসান্নাফে আবদুর রাজ্জাক)।\n" +
          "\n" +
          "আল্লাহর সন্তুষ্টি মুমিনের জীবনের লক্ষ্য। আনুগত্যে আল্লাহ সন্তুষ্ট হন, তাই মুমিনেরা ইবাদতে আনন্দ লাভ করেন। মহানবী (সা.) বলেছেন, \n\n‘রোজাদারের জন্য দুটি খুশি; একটি ইফতারের সময়, অপরটি আল্লাহর সঙ্গে সাক্ষাতের সময়।’ (মুসলিম)। আল্লাহ তাআলার নির্দেশ, ‘তোমরা সন্ধ্যা পর্যন্ত সিয়াম পূর্ণ করো।’ (সুরা-২ বাকারা, আয়াত: ১৮৭)। \n\nএই আদেশ পালনের আনন্দ প্রকাশিত হয় ইফতারের মাধ্যমে।",
      "anubat": ""
    },


    {
      "name": "ইসলামে সেহরির গুরুত্ব",
      "arobic": " ",
      "bangla": "সেহরি খাওয়া সুন্নত। সেহরিতে রয়েছে বরকত ও কল্যাণ। ইয়াহুদি-খ্রিস্টানরাও রোজা পালন করতো কিন্তু তারা ভোররাতে সেহরি গ্রহণ করতো না। \n\nতাই রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ভোররাতে সেহরি খাওয়ার বিশেষ তাগিদ দিয়েছেন। সেহরি খাওয়ার ফজিলত ও গুরুত্ব হলো-"
              "১. \nসেহরি পেট ভরে খাওয়া জরুরি নয় বরং ন্যূনতম এক ঢোক পানি পান করলেও সেহরি আদায় হয়ে যাবে। হাদিসে এসেছে, ‘রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম ইরশাদ করেন-\n\n تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بركَة অর্থাৎ ‘তোমরা সেহরি খাও। কেননা, সেহরিতে বরকত রয়েছে। (মুসলিম)  \n\nযেহেতু সেহরি খাওয়া বরকতের কাজ। সুতরাং ক্ষুধা লাগুক আর না লাগুক; খেতে ইচ্ছা হোক আর না হোক;\n তবুও সামান্য পরিমান হলেও শেষ রাতে খাবার খেয়ে নেয়া বরকতের কাজ। এ ক্ষেত্রে উদর ভর্তি করে খাওয়া আবশ্যক নয়। যদি কেউ শুধু পানি পান করে, শরবত পান করে বা একটি খেজুর খায় তবে কেউ এ বরকত থেকে বঞ্চিত হবে না।\n\n ইফতার যেমন তাড়াতাড়ি খাওয়া সওয়াবের কাজ; তেমনি সেহরি দেরিতে খাওয়া সওয়াবের কাজ। \n\nআর সুবহে সাদেক তথা ভোর রাতের শেষ সময়ে সেহরি খাওয়া মোস্তাহাব বা উত্তম। এর মানে এই নয় যে, ফজরের সময় হয়ে যাওয়ার ভয় থাকে। রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, আল্লাহ সকল আম্বিয়ায়ে কেরামকে তাড়াতাড়ি ইফতার করার নির্দেশ দিয়েছেন আর সেহরি দেরি করে খাওয়ার কথা বলা হয়েছে। \n\nতাইতো ‘সাহাবায়ে কেরাম আজমাঈন ‘সময় হওয়ার সাথে সাথে (দেরি না করে) ইফতার করতেন এবং সেহরির শেষ সময়ে খাবার খেতেন।’ (মুসান্নাফে ইবনে আবি শায়বা)"
              "২. \nঅন্য হাদিসে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, ‘সেহরি খাওয়া বরকতময় কাজ। সুতরাং তোমরা তা পরিত্যাগ করো না। এক ঢোক পানি দিয়ে হলেও সেহরি কর।\n\n কারণ যারা সেহরি খায় আল্লাহ তাআলা তাদের ওপর রহমত বর্ষণ করেন এবং ফেরেশতারা তাদের জন্য রহমতের দোয়া করেন।’\n\n (মুসনাদে আহমদ, মুসান্নাফ ইবনে আবি শায়বা, ইবনে হিব্বান) "
              "৩. \nনবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন, ‘আমাদের রোজা এবং আহলে কিতাব তথা ইহুদি ও খ্রিস্টানদের রোজার মধ্যে পার্থক্য হলো সেহরি খাওয়া। (অর্থাৎ মুসলিমরা সেহরি খায় আর ইহুদি ও খ্রিস্টানরা সেহরি খায় না)।’\n\n (মুসলিম, নাসাঈ)\n" +
          "\n" +
          "আল্লাহ তাআলা মুসলিম উম্মাহকে সেহরি খাওয়ার তাওফিক দান করুন। হাদিসে ঘোষিত ফজিলত, বরকত ও কল্যাণ পেতে নবিজি সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের অনুসরণ ও গুরুত্ব উপলব্ধি করে সেহরি খাওয়ার তাওফিক দান করুন। আমিন।",
      "anubat": ""
    },
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        systemOverlayStyle: SystemUiOverlayStyle(
          statusBarColor: HexColor("#254C27"),
        ),
        backgroundColor: HexColor("#254C27"),
        leading: InkWell(
          onTap: () {
            Navigator.pop(context);
          },
          child: Icon(Icons.arrow_back_ios),
        ),
        title: Text("রোজা"),
        centerTitle: true,
      ),
      body:ListView.builder(
          scrollDirection: Axis.vertical,
          itemCount: rojalistData.length,
          itemBuilder: (BuildContext context, int index) {

            return InkWell(
              onTap: (){
                Get.toNamed(RoutesName.rojaDetails,arguments: [
                  rojalistData[index]['name'].toString(),
                  rojalistData[index]['arobic'].toString(),
                  rojalistData[index]['bangla'].toString(),
                  rojalistData[index]['anubat'].toString(),

                ]);

              },
              child: Card(
                  color: Colors.white,
                  child: Padding(
                    padding: const EdgeInsets.only(
                        top: 20, bottom: 20, left: 20, right: 10),
                    child: Text(
                      rojalistData[index]['name'].toString(),
                      style: TextStyle(
                          color: HexColor("#254C27"),
                          fontSize: 18,
                          fontWeight: FontWeight.bold),
                    ),
                  )),
            );
          }),
    );
  }
}
